add support for git remotes to track draft views
